![png](EER.png)

In [21]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote
from sqlalchemy_utils import database_exists,create_database
## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'Alex270' # whatever password you chose during MySQL installation.

connection = f'mysql+pymysql://{username}:{password}@localhost/newbook'
engine = create_engine(connection)

In [22]:
if database_exists(connection):
    print('it existes!')
else:
    create_database(connection)
    print ('Data base created!')

Data base created!

In [24]:
q ='''SHOW TABLES;'''
pd.read_sql(q,engine)

Empty DataFrame
Columns: [Tables_in_newbook]
Index: []

In [42]:
users = pd.read_csv('Data/users.csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [43]:
users.to_sql('users', engine, index=False,if_exists='replace')

3

In [44]:
books = pd.read_csv('Data/books.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [45]:
books.to_sql('books', engine, index=False,if_exists='replace')

6

In [46]:
author = pd.read_csv('Data/author.csv')
author.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [47]:
author.to_sql('author', engine, index=False,if_exists='replace')

5

In [48]:
favorites = pd.read_csv('Data/favorites.csv')
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [49]:
favorites.to_sql('favorites', engine, index=False,if_exists='replace')

7

In [50]:
 q = '''SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));'''
pd.read_sql(q,engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1